<?php

session_start();//启用session
?>
<!DOCTYPE html>
<html>

<head>
    <meta charset="UTF-8">
    <title>后台管理系统</title>

    <!-- 公共样式 开始 -->
    <link rel="stylesheet" type="text/css" href="../../css/base.css">
    <link rel="stylesheet" type="text/css" href="../../css/iconfont.css">
    <!--		<script type="text/javascript" src="../../framework/jquery-1.11.3.min.js"></script>-->
    <script type="text/javascript" src="../../framework/jquery.form.min.js.js"></script>
    <script src="https://ajax.aspnetcdn.com/ajax/jquery/jquery-3.5.1.min.js"></script>
    <link rel="stylesheet" type="text/css" href="../../layui/css/layui.css">
    <script type="text/javascript" src="../../layui/layui.js"></script>
    <!-- 滚动条插件 -->
    <link rel="stylesheet" type="text/css" href="../../css/jquery.mCustomScrollbar.css">
    <script src="../../framework/jquery-ui-1.10.4.min.js"></script>
    <script src="../../framework/jquery.mousewheel.min.js"></script>
    <script src="../../framework/jquery.mCustomScrollbar.min.js"></script>
    <script src="../../framework/cframe.js"></script><!-- 仅供所有子页面使用 -->
    <script src="../../echarts/echarts.min.js"></script>

</head>

<body>
<!-- 为ECharts准备一个具备大小（宽高）的Dom -->
<div id="main" style="width: 1600px;height:800px;"></div>
<script type="text/javascript">
    // 基于准备好的dom，初始化echarts实例
    var myChart = echarts.init(document.getElementById('main'));

    // 指定图表的配置项和数据
    var option = {
        tooltip: {
            trigger: 'axis',
            position: function (pt) {
                return [pt[0], '10%'];
            }
        },
        title: {
            left: 'center',
            text: '大数据量面积图',
        },
        toolbox: {
            feature: {
                dataZoom: {
                    yAxisIndex: 'none'
                },
                restore: {},
                saveAsImage: {}
            }
        },
        xAxis: {
            type: 'category',
            boundaryGap: false,
            data: ['罗小黑战记', '我是不白吃', '时光代理人', '元龙 第二季', '元气食堂', '两不疑', '王者？别闹！', '镇魂街 第二季', '搜玄录之宸灵纪', '元龙', '天宝伏妖录 第二季', '小狮子赛几', '凹凸世界 第三季', '阿衰 第五季', '拾忆长安·明月几时有 第二季', '天官赐福', '镇魂街 第一季', '非人哉', '手机里的浣熊小镇', '源神浩劫', '灵笼', '伍六七之玄武国篇', '仙王的日常生活', '美影大乐园', '金光御九界之仙古狂涛', '如果历史是一群喵 第6季', '凡人修仙传', '一人之下 第二季', '雾山五行', '刺客伍六七', '凹凸世界 第一季', '天宝伏妖录', '我真的没用咩？', '被迫成为反派赘婿 动态漫', '师兄，请按剧本来！ 动态漫', '喜羊羊与灰太狼之羊村守护者', '百鬼幼儿园 第四季', '少年歌行', '通灵妃', '如果历史是一群喵 1-3季', '妖神记', '百妖谱', '京剧猫 第四季', '猫咪的人类饲养指南 动态漫', '我的囧囧发小', '一人之下', '凹凸世界 第二季', '大理寺日志', '我的天劫女友', '画江湖之不良人 第三季', '画江湖之不良人 第一季', '我的三体', '口水三国', '伍六七之最强发型师', '我的三体之章北海传', '逗酱萌鸭的睡前小故事', '凹凸学园', '阿衰 第三季', '一禅小和尚', '喜羊羊与灰太狼之奇趣外星客', '萌妻食神', '小黄人和萌友', '全职高手 第一季', '哈哈滑小稽', '凹凸学园 第二季', '如果历史是一群喵 4-5季', '我家大师兄脑子有坑', '画江湖之不良人 第二季', '京剧猫', '肥志百科', '女武神的餐桌 第二季', '我家大师兄是个反派', '虹猫蓝兔七侠传', '开心超人联盟之星之力', '前无古人 动态漫', '枪火天灵 动态漫', '19天 漫动画', '小绿和小蓝', '拾忆长安·明月几时有', '风灵玉秀', '剑网3·侠肝义胆沈剑心', '女武神的餐桌', '天行九歌', '阿衰', '京剧猫 第二季', '李林克的小馆儿', '茶啊二中 第二季', '战双帕尼尼', '阿衰 第四季', '凸变英雄 LEAF', '尸兄', '妖怪名单 第二季', '我的三体之罗辑传', '善良的阿呆 动态漫', '快把我哥带走', '请吃红小豆吧！ 第四季', '没出息的阴阳师一家2', '时空恋人 动态漫', '请吃红小豆吧！第二季', '请吃红小豆吧！']

        },
        yAxis: {
            type: 'value',
            boundaryGap: [0, '100%']
        },
        dataZoom: [{
            type: 'inside',
            start: 0,
            end: 10
        }, {
            start: 0,
            end: 10
        }],
        series: [
            {
                name: '模拟数据',
                type: 'line',
                symbol: 'none',
                sampling: 'lttb',
                itemStyle: {
                    color: 'rgb(255, 70, 131)'
                },
                areaStyle: {
                    color: new echarts.graphic.LinearGradient(0, 0, 0, 1, [{
                        offset: 0,
                        color: 'rgb(255, 158, 68)'
                    }, {
                        offset: 1,
                        color: 'rgb(255, 70, 131)'
                    }])
                },
                data: [2.0523474767762995, 0.8823529411764706, 0.9458418891170431, 1.2468963769951862, 3.4583333333333335, 2.2509557618787546, 1.5498621899273366, 0.289969450101833, 1.1325785244704163, 1.655801661213189, 2.752772177419355, 2.678861788617886, 1.6150864639236733, 2.158119658119658, 1.8711001642036125, 2.7537993920972643, 1.1982174240522219, 1.3758758758758758, 2.9567567567567568, 0.9110985277463194, 1.2064994882292732, 1.7746693794506612, 0.7961654894046418, 2.701117318435754, 1.4811764705882353, 2.319980538436588, 0.9463248295023996, 1.3365505139132614, 1.5978593272171253, 1.263819095477387, 1.5195244055068835, 2.805604423221915, 2.7488839285714284, 1.4059405940594059, 2.4035087719298245, 2.313713133350139, 2.522776572668113, 1.252442996742671, 1.0351689612015018, 2.0645968953430147, 0.6311967951927892, 1.4248120300751879, 2.1760051880674447, 2.762295081967213, 1.9142857142857144, 1.1426960661488348, 1.713820731096645, 2.2564584900928017, 1.6618625277161863, 0.5534115467736956, 1.2535605289928788, 1.4818372336709744, 1.337528604118993, 1.498748122183275, 1.8304042179261863, 2.9776119402985075, 2.1219512195121952, 1.2733990147783252, 2.386986301369863, 2.651682571572074, 1.191941941941942, 1.37624750499002, 1.327827827827828, 1.832263242375602, 1.647701918786256, 2.4756709305242035, 1.084834834834835, 1.2159785932721712, 2.0475094181665967, 2.496596710153148, 1.8273703041144902, 1.6209232313095836, 1.704118404118404, 2.7016280525986223, 1.7170542635658914, 2.0722120658135283, 0.6955645161290323, 2.4364841210302575, 1.8094812164579606, 2.1306602580318743, 1.7692019014260696, 1.525993883792049, 1.3679009256942707, 0.8395046284713535, 2.110148514851485, 2.3490888382687927, 1.1765498652291104, 2.1894939493949397, 1.835632183908046, 0.9773466833541927, 0.5492801771871539, 0.9459459459459459, 1.9736688972941518, 0.7156488549618321, 1.2514407416687547, 2.976148016049933, 2.0089747490112564, 1.416030534351145, 1.9617590822179731, 2.9381545428814038]

            }
        ]
    };

    // 使用刚指定的配置项和数据显示图表。
    myChart.setOption(option);
</script>
</body>

</html>